app/controllers/qa_controller.rb

  def index
    @existing = QuestionsAnswersExisting.all
    @new = QuestionsAnswersNew.all

    if request.post?

      if params[:questions_answers_new]
        @item = QuestionsAnswersNew.new(params[:questions_answers_new])
        if @item.save
---
SELECT * FROM "questions_answers_existing" ORDER BY id
SELECT * FROM "questions_answers_new" WHERE (1 = 1) ORDER BY position DESC, position LIMIT 1
INSERT INTO "questions_answers_new" ("question", "answer", "position", "eta", "created_at", "updated_at") VALUES('asdf', NULL, 1, NULL, '2010-08-26 18:59:43', '2010-08-26 18:59:43')